// Указываем версию солидити для компилятора

// Инициализация контракта

    // Создаем mapping - ассоциативный массив, в котором ключом будет адрес, а значением - баланс

    // Функция для инициализации контракта (принимает общее число токенов)

        // Создаем все токены на кошельке того, кто создал токен

    // Функция для отправки токенов
    // Фукнция принимает адрес того, кому нужно отправить токены
    // и число токенов, которое мы хотим отправить

        // Проверяем хватает ли токенов у того, кто хочет их отправить

        // Проверяем, не произошло ли переполнение

        // Забираем токены у того, кто их отправил

        // Передаем токены тому, кому мы их отправили