// Указываем версию для компилятора

// Объявляем интерфейс для токена

// Объявляем контракт

// Объявляем переменную для стомости токена

    // Объявялем переменную для токена


    // Функция инициализации (принимает токен
        // Присваиваем токен

        // Присваем стоимость
        // ВНИМАНИЕ: стоимость указана в веях для одной минимальной единицы токена (0.0..decimals..1 токена)

    // Функция для прямой отправки эфиров на контракт

        // Вызываем внутреннюю функцию для покупки токенов


    // Вызываемая функция для отправки эфиров на контракт, возвращающая количество купленных токенов

        // Вызываем внутреннюю функцию для покупки токенов

        // Возвращаем значение


    // Внутренняя функция покупки токенов, возвращает число купленных токенов

        // Рассчитываем стоимость

        // Отправляем токены с помощью вызова метода токена

        // Возвращаем значение
