// Версия солидити

// Подключаем библиотеку


// Объявляем контракт


    // Объявляем переменную, в которой будем хранить стоимость доллара


    // В эту функцию ораклайзер будет присылать нам результат

        // Проверяем, что функцию действительно вызывает ораклайзер
        // Обновляем переменную со стоимостью доллара

    // Функция для обновления курса доллара
        // Проверяем, что хватает средств на вызов функции
            // Если не хватает, просто завершаем выполнение
            // Если хватает - отправляем запрос в API