// Версия solidity

// Объявляем название библиотеки

    // Создаем функцию для просмотра массива

        // Проходимся по массиву

            // Если нашли число - возвращаем его индекс

        // Если не нашли число, возвращаем uint(-1)


// Создаем простенький контракт

    // Указываем, что будем использовать нашу библиотеку для

    // [1,2,3,4,5,6,7,8,9] - например у нас будет вот такой вот массив чисел

    // Функция для того, чтобы добавить число в массив

    // Функция, которой мы будем заменять старое число на новое
    // 1,9 => [9,2,3,4,5,6,7,8,9]
    // 10,1 => [1,2,3,4,5,6,7,8,9,1]

        // Ищем позицию с помощью библиотеки

        // Если позиция такая не была найдена - добавляем элемент

        // Иначе - заменяем его