pragma solidity ^0.4.11;

// Интерфейс токена


// Контракт ДАО


    // Переменная для хранения токена

    // Минимальное число голосов


    // Переменная, в которой будем хранить предложенное название


    // Переменная для хранения статуса голосования


    // Структура для хранения голосования


    // Структура для голосования


    // Функция инициализации


    // Фукнция для предложения нового имени

        // Проверяем, что голосование не идет сейчас

        // Останавливаем работу токена


    // Фукнция для голосования

        // Проверяем, что идет голосование


        // Логика для голования


    // Функция для смены символа

        // Проверяем, что голование активно

        // Проверяем, что получили достаточное количество голосов

        // Если собрали нужное число голосов, то обновляем имя


        // Сбрасываем все переменные для голосования


        // Возобновляем работу токена
